/* ● 7. Дадени са два правоъгълника със страни успоредни на координатните оси. Да се намерят:
сумата от лицата им, лицето на обединението и сечението им.
Вход. На всеки от редовете на стандартния вход ще бъде зададена по една двойка
правоъгълници с осем цели неотрицателни числа – координати на горния ляв и долния десен
ъгъл на единия и другия правоъгълник.
Ограничения. Всички числа са по-малки или равни на 100.
Изход. За всяка двойка правоъгълници, на един ред на стандартния изход програмата трябва да
изведе 3 числа — сумата от лицата на двата правоъгълника, лицето на обединението и лицето
на сечението им.
Пример:
Вход.          |Изход.
 0 1 1 0 0 2 2 0 |5 4 1
 0 1 1 0 2 1 3 0 |2 2 0
 0 2 3 1 1 3 2 0 |6 5 1  */

#include"task07H.h"

int main()
{ // 0 1 1 0 0 2 2 0
    Point top1 = {0, 1}, top2 = {1, 0};
    Point bot1 = {0, 2}, bot2 = {2, 0};

    printf("%d ", sumOfareaOfRect(top1, top2, bot1, bot2));
    printf("%d ", FindPoints(top1, top2, bot1, bot2));

    printf("\n");
    // 0 1 1 0 2 1 3 0
    Point x1 = {0, 1}, y1 = {1, 0};
    Point x2 = {2, 1}, y2 = {3, 0};

    printf("%d ", sumOfareaOfRect(x1, y1, x2, y2));
    printf("%d ", FindPoints(x1, y1, x2, y2));

    printf("\n");
    // 0 2 3 1 1 3 2 0
    Point z1 = {0, 2}, t1 = {3, 1};
    Point z2 = {1, 3}, t2 = {2, 0};

    printf("%d ", sumOfareaOfRect(z1, t1, z2, t2));
    printf("%d ", FindPoints(z1, t1, z2, t2));
    return 0;
}