/*Дадена е редица от N цели положителни числа. Напишете програма, която
намира дължината на най-дългата подредица, сумата от елементите на която се
дели без остатък на дадено число K. Не е задължително подредицата да съдържа
последователни елементи от дадената редица. Подредицата може да бъде празна
(т.е. с дължина 0), както и може да съвпада с цялата редица.
Вход
Първият ред съдържа две числа N и K. Следват елементите на редицата.
Всички числа във входа (включително N и К) са цели положителни числа, по-малки от
1000.
Изход
Дължината на най-дългата намерена подредица с описаното свойство.
Пример
Вход:
7 5
1 2 1 2 2 1 4
Изход:
5 
*/
#include "task16H.h"

int main()
{   
    int size = 0;
    int k = 0;

    printf("Enter size: ");
    scanf("%d", &size);

    printf("Enter divider: ");
    scanf("%d", &k);

    int array[size];
    fillArray(array, size);
    
    printf("%d", findBiggestSequence(array, size, k));
    
    return 0;
}