/*
6. Даден e масив от 5 положителни числа. Да се напишат две функции, които
намират минималната и максималната стойност, които могат да се
изчислят, като се сумират точно 4 от тези 5 числа.
● Програмата чете масива от тези 5 числа, извиква съответните функции и
отпечатва съответно minimum и maximum стойностите, всяка на нов ред.
arr = [1,3,5,7,9]
minimum sum is 1 + 3 + 5 + 7 = 16
maximum sum is 3 + 5 + 7 + 9 = 24.
5. отпечатва се 16 24 
*/
#include"task06H.h"

int  main ()
{
    int arr[] = {5,2,3,4,5};
 
    printf("maxSum = %d\n", maxSum(arr));
    printf("minSum = %d\n",minSum(arr));

    return 0;
}